{
    "robotPu.setServoInitialState": "Set servo initial state. This is a background function, only for after-sales use, users do not need to operate.",
    "robotPu.setWalkSpeedRange": "Set walking speed range. Configure maximum speed of robot for forward and backward movement.",
    "robotPu.ultrasonicDistance": "Get ultrasonic sensor distance. Returns distance detected by the ultrasonic sensor, units can be selected as centimeters or inches.",
    "robotPu.setAmbienceLight": "Set ambience light. Set the selected ambience light to the specified RGB color.",
    "robotPu.setEyesState": "Set left/right eye state. Turn the left and right eyes on or off.",
    "robotPu.setLeftEyeBrightness": "Set left eye brightness. Adjust the brightness of the left eye light.",
    "robotPu.setRightEyeBrightness": "Set right eye brightness. Adjust the brightness of the right eye light.",
    "robotPu.executeAction": "Execute action. Perform the specified preset action. When \"Explore\" is selected, the robot will walk forward and automatically turn when encountering obstacles; when \"Remote Control\" is selected, it needs to be used with the \"Remote Control\" function.",
    "robotPu.setMoveDirection": "Set robot move direction. Set the movement direction of the PU robot.",
    "robotPu.setWalkSpeed": "Set robot walk speed and turn. Set the walking speed and turning direction of the PU robot.",
    "robotPu.talk": "Talk. Make the robot say the specified text.",
    "robotPu.sing": "Sing. Make the robot sing the specified song or command.",
    "robotPu.setServoAngle": "Set servo angle. Directly rotate the specified servo to the target angle.",
    "robotPu.smoothSetServoAngle": "Smooth set servo angle. Smoothly rotate the specified servo to the target angle with the specified step length.",
    "robotPu.setControllerRadioGroup": "Set controller radio group. Set the radio channel for the controller (0-255). This block automatically initializes all controller buttons.",
    "robotPu.readJoystickValue": "Read joystick value. Read the joystick value for the specified axis (-1 to 1).",
    "robotPu.initControllerButtons": "Initialize controller buttons. Set up pull-up resistors for all controller buttons.",
    "robotPu.getControllerButtonPressed": "Get controller button pressed. Check if the specified controller button is pressed.",
    "robotPu.sendControlValue": "Send control value. Send a control value to the robot.",
    "robotPu.sendTextMessage": "Send text message. Send a text message to the robot.",
    "robotPu.enableRemoteControlWithGroup": "Enable remote control with group. Enable the robot to receive remote control commands and set the radio group.",
    "robotPu.disableRemoteControl": "Disable remote control. Disable the robot from receiving remote control commands.",
    "robotPu.onControlValueReceived": "On control value received. Run code when a control value is received from the controller.",
    "robotPu.getControlValue": "Get control value. Get the most recently received control value from the controller."
}
